#### 1 Region and Domain
State the region and the domain category that your data sets are about.

India,

Average Rainfall, Maximum and Minimum Temperature

#### 2 Research Question
How has the average rainfall, Maximum and Minimum Temperature has changed over the decades between 1901-2015.

#### 3 Links
[rainfall-in-india](https://www.kaggle.com/rajanand/rainfall-in-india/)

[weather-data-in-india-from-1901-to-2015](https://www.kaggle.com/mahendran1/weather-data-in-india-from-1901-to-2017)

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt 

plt.style.use('seaborn')

In [2]:
rainfallDfBase = pd.read_csv('rainfall in india 1901-2015.csv')
rainfallDfBase.head()

,SUBDIVISION,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,ANNUAL,Jan-Feb,Mar-May,Jun-Sep,Oct-Dec
0,ANDAMAN & NICOBAR ISLANDS,1901,49.2,87.1,29.2,2.3,528.8,517.5,365.1,481.1,332.6,388.5,558.2,33.6,3373.2,136.3,560.3,1696.3,980.3
1,ANDAMAN & NICOBAR ISLANDS,1902,0.0,159.8,12.2,0.0,446.1,537.1,228.9,753.7,666.2,197.2,359.0,160.5,3520.7,159.8,458.3,2185.9,716.7
2,ANDAMAN & NICOBAR ISLANDS,1903,12.7,144.0,0.0,1.0,235.1,479.9,728.4,326.7,339.0,181.2,284.4,225.0,2957.4,156.7,236.1,1874.0,690.6
3,ANDAMAN & NICOBAR ISLANDS,1904,9.4,14.7,0.0,202.4,304.5,495.1,502.0,160.1,820.4,222.2,308.7,40.1,3079.6,24.1,506.9,1977.6,571.0
4,ANDAMAN & NICOBAR ISLANDS,1905,1.3,0.0,3.3,26.9,279.5,628.7,368.7,330.5,297.0,260.7,25.4,344.7,2566.7,1.3,309.7,1624.9,630.8

In [3]:
temperatureBase = pd.read_csv('Temprature in india 1901-2015.csv')
temperatureBase.head()

,Unnamed: 0,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC
0,0,1901,17.99,19.43,23.49,26.41,28.28,28.60,27.49,26.98,26.26,25.08,21.73,18.95
1,1,1902,19.00,20.39,24.10,26.54,28.68,28.44,27.29,27.05,25.95,24.37,21.33,18.78
2,2,1903,18.32,19.79,22.46,26.03,27.93,28.41,28.04,26.63,26.34,24.57,20.96,18.29
3,3,1904,17.77,19.39,22.95,26.73,27.83,27.85,26.84,26.73,25.84,24.36,21.07,18.84
4,4,1905,17.40,17.79,21.78,24.84,28.32,28.69,27.67,27.47,26.29,26.16,22.07,18.71

In [4]:
rainfallDfGroupBy = rainfallDfBase.groupby(['YEAR'])
rainfallDfBase = rainfallDfGroupBy.mean()
rainfallDfBase.reset_index(inplace = True)

col = rainfallDfBase.loc[: , "JAN":"DEC"]
rainfallDfBase['MEAN'] = col.mean(axis=1)
rainfallDfBase['MAX'] = col.max(axis=1)
rainfallDfBase['MIN'] = col.min(axis=1)
rainfallDfBase

rainfallDfBase.head()

,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,...,NOV,DEC,ANNUAL,Jan-Feb,Mar-May,Jun-Sep,Oct-Dec,MEAN,MAX,MIN
0,1901,35.220000,40.508571,21.097143,46.388571,70.434286,194.608571,291.208571,301.325714,134.154286,...,64.757143,10.808571,1284.214286,75.722857,137.920000,921.305714,149.262857,107.017381,301.325714,10.808571
1,1902,8.520000,8.305714,20.951429,45.771429,72.040000,168.820000,351.145714,239.800000,258.611429,...,43.457143,33.151429,1337.302857,16.814286,138.777143,1018.385714,163.334286,111.440714,351.145714,8.305714
2,1903,16.851429,14.342857,26.577143,16.974286,80.237143,171.988571,362.108571,299.482857,216.620000,...,48.523529,22.311765,1399.908824,31.197143,123.768571,1050.194286,197.535294,116.780322,362.108571,14.342857
3,1904,11.697143,9.391429,28.880000,41.402857,92.454286,237.485714,311.971429,217.014286,167.402857,...,19.757143,14.771429,1236.771429,21.077143,162.734286,933.874286,119.085714,103.065000,311.971429,9.391429
4,1905,23.200000,20.477143,40.940000,34.754286,76.437143,164.805714,288.314286,246.780000,179.260000,...,16.025714,17.005714,1186.177143,43.674286,152.128571,879.171429,111.205714,98.847381,288.314286,16.025714

In [5]:
col = temperatureBase.loc[: , "JAN":"DEC"]
temperatureBase['MAX'] = col.max(axis=1)
temperatureBase['MIN'] = col.min(axis=1)
temperatureBase['MEAN'] = col.mean(axis=1)
temperatureBase

,Unnamed: 0,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,MAX,MIN,MEAN
0,0,1901,17.99,19.43,23.49,26.41,28.28,28.60,27.49,26.98,26.26,25.08,21.73,18.95,28.60,17.99,24.224167
1,1,1902,19.00,20.39,24.10,26.54,28.68,28.44,27.29,27.05,25.95,24.37,21.33,18.78,28.68,18.78,24.326667
2,2,1903,18.32,19.79,22.46,26.03,27.93,28.41,28.04,26.63,26.34,24.57,20.96,18.29,28.41,18.29,23.980833
3,3,1904,17.77,19.39,22.95,26.73,27.83,27.85,26.84,26.73,25.84,24.36,21.07,18.84,27.85,17.77,23.850000
4,4,1905,17.40,17.79,21.78,24.84,28.32,28.69,27.67,27.47,26.29,26.16,22.07,18.71,28.69,17.40,23.932500
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
110,110,2011,18.32,20.79,24.11,26.10,28.92,28.60,27.60,27.20,26.70,25.51,22.84,19.84,28.92,18.32,24.710833
111,111,2012,18.25,20.43,23.98,26.89,28.72,28.91,27.98,27.31,26.65,24.85,22.26,19.91,28.91,18.25,24.678333
112,112,2013,18.88,21.07,24.53,26.97,29.06,28.24,27.50,27.22,26.87,25.63,22.18,19.69,29.06,18.88,24.820000
113,113,2014,18.81,20.35,23.34,26.91,28.45,29.42,28.07,27.42,26.61,25.38,22.53,19.50,29.42,18.81,24.732500
114,114,2015,19.02,21.23,23.52,26.52,28.82,28.15,28.03,27.64,27.04,25.82,22.95,20.21,28.82,19.02,24.912500

In [6]:
weather = pd.DataFrame(rainfallDfBase['YEAR'])
weather['MEAN_RAINFALL'] = rainfallDfBase['MEAN']
weather['MEAN_TEMP'] = temperatureBase['MEAN']


weather

     YEAR  MEAN_RAINFALL  MEAN_TEMP
0    1901     107.017381  24.224167
1    1902     111.440714  24.326667
2    1903     116.780322  23.980833
3    1904     103.065000  23.850000
4    1905      98.847381  23.932500
..    ...            ...        ...
110  2011     116.079167  24.710833
111  2012     108.034921  24.678333
112  2013     122.929167  24.820000
113  2014     103.696759  24.732500
114  2015     106.714120  24.912500

[115 rows x 3 columns]

In [7]:
FinalDF = weather.groupby(np.arange(len(weather))//10).mean()
FinalDF['YEAR'] =  (FinalDF['YEAR'].round() + 4)
FinalDF['YEAR'] = pd.to_numeric(FinalDF['YEAR'], downcast='integer')
FinalDF

    YEAR  MEAN_RAINFALL  MEAN_TEMP
0   1910     109.992000  23.991083
1   1920     116.739849  23.965750
2   1930     122.042560  24.124333
3   1940     123.823138  24.089833
4   1950     122.922694  24.155833
5   1960     122.976077  24.238500
6   1970     118.458935  24.148333
7   1980     115.760856  24.193167
8   1990     117.878981  24.268667
9   2000     118.338878  24.544583
10  2010     112.569092  24.861583
11  2017     111.490827  24.770833

In [8]:
weather1 = pd.DataFrame(rainfallDfBase['YEAR'])
weather1['MAX_RAINFALL'] = rainfallDfBase['MAX']
weather1['MIN_RAINFALL'] = rainfallDfBase['MIN']
weather1['MAX_TEMP'] = temperatureBase['MAX']
weather1['MIN_TEMP'] = temperatureBase['MIN']
weather1

FinalDFMin = weather1.groupby(np.arange(len(weather1))//10).min()
FinalDFMax = weather1.groupby(np.arange(len(weather1))//10).max()
FinalDFMin
FinalDFMax

FinalDF1['YEAR'] = FinalDFMax['YEAR']
FinalDF1['MIN_RAINFALL'] = FinalDFMin['MIN_RAINFALL']
FinalDF1['MAX_RAINFALL'] = FinalDFMax['MAX_RAINFALL']
FinalDF1['MIN_TEMP'] = FinalDFMin['MIN_TEMP']
FinalDF1['MAX_TEMP'] = FinalDFMax['MAX_TEMP']
FinalDF1

NameError: name 'FinalDF1' is not defined

In [ ]:
FinalDF1.reset_index(inplace = True)
FinalDF.reset_index(inplace = True)

x = FinalDF1['YEAR']
print(x)
y2 = FinalDF['MEAN_TEMP'].tolist()
y3 = FinalDF['MEAN_RAINFALL'].tolist()

z1 = FinalDF1['MIN_TEMP'].tolist()
z2 = FinalDF1['MAX_TEMP'].tolist()
z3 = FinalDF1['MIN_RAINFALL'].tolist()
z4 = FinalDF1['MAX_RAINFALL'].tolist()

In [ ]:
import matplotlib.gridspec as gridspec
fig = plt.figure(figsize=(20, 20))
gspec = gridspec.GridSpec(3, 1)
gspec.update(hspace=0.45, wspace=1)

ax1 = plt.subplot(gspec[0, 0], sharex = ax3)
ax2 = plt.subplot(gspec[1, 0], sharex = ax3)
ax3 = plt.subplot(gspec[2, 0], sharex = ax3)

ax1.plot(x, y2, '-o', label = "Mean Temperature ($\,^{\circ}\mathrm{C}$)")
ax1.plot(x, y3, '-*', label = "Mean Rainfall (0.1cm)")

ax1.set_xlabel("Decade")
ax1.set_ylabel("")
ax1.set_title('Average Mean Rainfall in India(1901-2015) (in $\,^{\circ}\mathrm{C}$) and Rainfall')

ax1.legend(loc="best")



ax2.plot(x, y3, '-*', label = "Mean Rainfall (0.1cm)")
ax2.plot(x, z3, '-*', label = "Minimum Rainfall (0.1cm)")
ax2.plot(x, z4, '-^', label = "Maximun Rainfall (0.1cm)")

ax2.set_xlabel("Decade")
ax2.set_ylabel("")
ax2.set_title('Average Mean, Maximum and Minimum Rainfall in India(1901-2015) (in $\,^{\circ}\mathrm{C}$) and Rainfall')

ax2.legend(loc="best")

ax3.plot(x, z1, '-s', label = "Minimum Temperature ($\,^{\circ}\mathrm{C}$)")
ax3.plot(x, z2, '-o', label = "Maximun Temperature ($\,^{\circ}\mathrm{C}$)")
ax3.plot(x, y2, '-o', label = "Mean Temperature ($\,^{\circ}\mathrm{C}$)")


ax3.set_xlabel("Decade")
ax3.set_ylabel("")
ax3.set_title('Average Mean, Maximum and Minimum Temperatures in India(1901-2015) (in $\,^{\circ}\mathrm{C}$) and Rainfall')

ax3.legend(loc="center right")
plt.xticks(np.arange(min(x), max(x)+10, 10))
plt.savefig('assignment4-2.png')